<?php

namespace Database\Seeders;

use App\Models\Setting;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SettingsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Setting::upsert(
            [
                ['key'=>'appName', 'value'=> config('app.name')],
                ['key'=>'appDisc', 'value'=> config('app.name')],
                ['key'=>'appLogo', 'value'=> config('app.url').'/filemanager/uploads/E&S-01.png'],
                ['key'=>'appMiniLogo', 'value'=> config('app.url').'/filemanager/uploads/EDU-01.png'],
                ['key'=>'appDarkLogo', 'value'=> config('app.url').'/filemanager/uploads/E&S-01.png'], 
                ['key'=>'appMiniDarkLogo', 'value'=> config('app.url').'/filemanager/uploads/EDU-01.png'], 
                ['key'=>'appIcon', 'value'=> config('app.url').'/filemanager/uploads/EDU-01.png'],
                ['key'=>'appMail', 'value'=> 'info@naiosh.us'],
                ['key'=>'appMobile', 'value'=> '966558266618'],
                ['key'=>'appAddress', 'value'=> 'المملكة العربية السعودية'],
                ['key'=>'appDisc', 'value'=> 'إدارة الحجاج والموظفين.'],
                ['key'=>'appNewAccount', 'value'=> '1'],
                ['key'=>'appDefaultRole', 'value'=> ' user'],
                ['key'=>'appPolicy', 'value'=> '<h1 style="box-sizing: border-box; font-family: NotoKufiArabic;">سياسة الخصوصية</h1>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تعتبر سياسة الخصوصية في أديو سمارتكس .. ملزمة لجميع العاملين دون استثناء ... وال يتم العمل التعامل مع اي شخص يرغب التعامل مع األكاديمية اال بعد الموافقة على سياسة الخصوصية .. والتي تم رفعها على موقع اديو سمارتكس وجميع البرامج التي يكون فيها طرف ثاني وثالث .. بالأضافة الى التطبيقات التي يتم العمل من خاللها لتسهيل العمل على جميع من يتعامل مع سمارتكس .. وفي حال عدم موافقة العميل على الموافقة على سياسة الخصوصية فإنه لن يتم التعامل مع بياناته .. وفي حال رفع هو اي بيانات وكانت عرضة للغير فإن سمارتكس غير مسؤولة عن اي اختراقات من قبل الغير... الأن بموافقته على سياسة الخصوصية فأنه اي بيانات تخص العميل تنتقل مباشرة الى الملف الآمن من البرنامج</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">الإجراءات</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تعتبر الإجراءات الخاصة في تنفيذ سياسة الخصوصية هي اقصر الطرق واكثرها أمانا.. وعلى جميع المعنيين بسمارتكس العمل من خلال هذه الإجراءات على ان تكون موقعة وموافق عليها من قبل العملي .. ويتم رفعها بشكل واضح لجميع الاعمال على كافة المواقع والتطبيقات التي سيدخل عليها العميل لتنفيذ عمله. والجميع تحت طائلة المسائلة القانونية ..</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">بنود الخصوصية:</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">سمارتكس يرحب بجميع المرتبطين بالأكاديمية بالتعليم الإلكتروني من مستفيدين .. ادارين.. مدربين .. وزوار .. وتتعهد سمارتكس وتلتزم بحماية الخصوصية في جميع منصات سمارتكس الإلكترونية من برامج او تطبيقات كما ان سمارتكس تلتزم بالتعامل مع المعلومات الشخصية التي يتم دخول منصات سمارتكس بكامل السرية والأمان.. وستقوم سمارتكس بشرح كل السياسات الخاصة بسياسة الخصوصية للتعامل مع مواقعها الألكترونية ومنصاتها التعليمية عن بعد.. وهذه السياسات هي:</p>
                <ol style="box-sizing: border-box; font-family: NotoKufiArabic;">
                <li style="box-sizing: border-box;">سياسة جمع البيانات وتصنيفها</li>
                <li style="box-sizing: border-box;">سياسة المعلومات الخاصة بالمستفيدين والمتدربين والمدربين والزوار</li>
                <li style="box-sizing: border-box;">سياسة افشاء اسرار البيانات</li>
                <li style="box-sizing: border-box;">سياسة النشر على المواقع</li>
                <li style="box-sizing: border-box;">سياسة وجود برامج تدريبية كطرف ثالث</li>
                <li style="box-sizing: border-box;">سياسة المحتوى واإللتزام بالقوانين الرسمية</li>
                </ol>
                <p><span style="font-family: NotoKufiArabic;">وتعتبر المعلومات الشخصية من عنوان وبريد الكتروني ورقم الهاتف ورقم الجوال او اي معلومات يتم ادخالها ضمن البيانات المطلوب تسجيلها في نموذج التسجيل الخاص بسمارتكس حيث انه يحق لسمارتكس ان تجعل من هذه البيانات محتوى منشور ولكن يجب اعتبارها معلومات شخصية خاصة لا يجوز التصرف بها خارج نطاق سياسة خصوصية المعلومات الشخصية</span></p>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">&nbsp;</p>
                <div class="lm-logo-container" style="box-sizing: border-box; text-align: center; font-family: NotoKufiArabic;"><img src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></div>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">سياسة تحديثات المواقع والتطبيقات والبروتوكولات</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تقتضي الجودة ان يكون تحديث مستمر في البرامج التشغيلية .. ولهذا فإن سياسة التحديث تكون ضمن السياسات الرسمية التي تعمل من خلالها سمارتكس&nbsp; .. وبالتالي فإن جميع الشروط وسياسات الخصوصية التي فرضت على هذه البرامج األساسية سيتم فرضها على كل التحديثات والتي تكون ضمن التطوير الخاص بسمارتكس . ومن هنا فإن اي اضافة او تحديث على البرامج فإنه سيتم تغيير وتحديث سياسة الخصوصية الرئيسية بكافة اقسامها&nbsp; وسيتم نشر وتعميم التعديل على جميع المعنيين من هذه السياسة .. ومن حق المعنيين ابالغهم بتغيير وتعديل وتطوير سياسة الخصوصية قبل الشروع بتعديلها وتحديد فترة بداية ونهاية التعديل</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">المعلومات والبيانات الشخصية</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تنقسم المعلومات التي يتم طلب تسجيلها بطلب التسجيل ما هو اجباري ومنها ما يكون اختياري.. مثل الأسم وتاريخ ومكان الولاده والجنس والمعلومات الخاصة بالعنوان وغيرها بالاضافة الى التعليقات والردود والمشاركة في نشر المعلومات وتسجيل اإلعتراضات .. وهنا تلتزم سمارتكس بما يتم الاتفاق&nbsp; عليه مع الذي يقوم بالتسجيل حيث ان األقرار بالموافقة على سياسة الخصوصية فإن كال الطرفين سمارتكس والطرف الأخر ملزمين بتنفيذ ما جاء بالخصوصية والتي تعتني بالأمان وسرية المعلومات وعدم الافشاء من الطرفين وهذا ينطبق لجميع من يدخل ويسجل على الموقع الخاص بالتعليم الإللكرتوني الخاص ب سمارتكس</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">حق استخدام البيان من كلا الطرفين</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تعتبر سياسة الخصوصية ملزمة لجميع الأطراف .. ولهذا وجب على الطرفين اخطار الطرف األخر عن رغبته في استخدام كل البيانات او بعضها.. والحصول على موافقة قبل الإستخدام .. اذا لم تنص سياسة الخصوصية على المنع القطعي لإلستخدام.. وتشمل هذه هوية نايوش واوراقها الرسمية واألختام الخاصة واختام السيلد التي من الممكن استخدامها رقميا.. باإلضافة الى المعلومات ومنشورات الطرف الثاني .. عبر اإلنترنت او طباعتها ورقيا وتنص اسياسة الخصوصية بضمان المحافظة على جميع ما يتم اإلتفاق عليه بين الطرفين</p>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">اما بخصوص البيانات التي يتم تجميعها والتي تكون في بعض األحيان من حق الطرف الثاني فإن نايوش تضمن عدم استخدامها قبل الحصول على موافقة صاحب العالقة .. وتتعهد بعدم نشرها الكترونيا او ورقيا</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">السياسة الخصوصية لسرية المعلومات</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تعتبر سياسة اخصوصية الخاصة بنايوش في جميع فروعها ملزمة لنايوش وللطرف األخر وقد تم تجميع البيانات الخاصة بالمستخدمين من خالل نماذج التسجيل او عبر شبكة اإلنترنت عند زيارة مواقعنا اإللكترونية باإلضافة الي توضيح كيفية استخدام هذه البيانات حيث اننا لم نقم بتصمم مواقعنا التشغيلية من اجل جميع البيانات وانما تم تصميم المواقع من اجل العملية التشغيلة .. والتي يحتاجها من يقوم بتصفح مواقعنا وسيتم استخدام هذه البيانات التي تقوم إداخلها بمحض ارادتك</p>
                <div class="lm-logo-container" style="box-sizing: border-box; text-align: center; font-family: NotoKufiArabic;"><img src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></div>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">البروتوكولات وشبكة الإنترنت (ip)</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">عندما تقوم بزيارة اي موقع من خلال الانترنت .. فإن الخادم المضيف بتسجيل عنوان شبكة الانترنت ( IP ) الخاص بك وتاريخ الزيارة ووقت الزيارة ونوع المتصفح التي تستخدمه والتي تقوم بإحالتك على الموقع الذي تبحث عنه</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">تجميع البيانات عن الشبكة</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">هناك مواقع على اإلنترنت خارج سيطرتنا مثل اعالنات قوقل واعالنات الفيس ومواقع تواصل اخرى .. وسياسة نايوش الخصوصية ال تغطي مثل هذه اإلعالنات او الروابط.. ويبقى األمان او الدخول للموقع هو خيار شخصي ال تغطيه الخصوصية</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">بيانات مطلوبة من المستخدم</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">قد يطلب المستخدم خدمات خاصة تحتاج الي معرفة بياناته .. وعند تزويدنا بهذه البيانات بمحض ارادتك والتي ستياعدنا باإلتصال مع الطرف المستخدم او معرفة مكان تواجدك وذلك من اجل تقديمها لصاحب خدمات كطرف ثالث فإننا في نايوش ملزمين بأخذ موافقتك المسبقة والمكتوبة الكترونيا .. بإنك تقر لنايوش بإستخدام هذه البيانات دون الدخول في ضرر متعمد</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">إفاء المعلومات</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تتعهد سمارتكس بالالتزام&nbsp; بسياسة الخصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها. ولن يتم بموجب القانون أو عندما نعتقد بحسن نية أن مثل هذا اإلجراء إفشاء هذه المعلومات الا إذا كان ذلك مطلوباً فيه ليساير القانون أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع أو مرغوباً سيكون مطلوباً أو الجهات المستفيدة منه.</p>
                <div class="lm-logo-container" style="box-sizing: border-box; text-align: center; font-family: NotoKufiArabic;"><img src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></div>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">إفشاء المعلومات لأي طرف ثالث</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تتعهد سمارتكس بعدم القيام ببيع أو المتاجرة أو تأجير أو إفشاء أية معلومات لصالح أي طرف ثالث خارج هذا الموقع أو المواقع التابعة له. وسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل أي سلطة قضائية أو تنظيمية.</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">التعديلات على سياسة سرية وخصوصية المعلومات</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">تحتفظ سمارتكس بحقها في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك مالئما .</p>
                <h2 style="box-sizing: border-box; color: var(--main-color); font-family: NotoKufiArabic;">عند الإتصال بنا</h2>
                <p style="box-sizing: border-box; font-family: NotoKufiArabic;">سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس من السرية. في كل ما تقوم به من تقديم معلومات ضمن الإستبيانات او كنماذج الإلتحاق او التعليق او ارسال للرسائل الخاصة</p>'],
                ['key'=>'appTerms', 'value'=> '<h2 style="text-align: center;"><strong>سياسة وشروط الاستخدام </strong></h2>
                <p>&nbsp;</p>
                <p>&nbsp;سياسة الاستخدام المقبول هي مجموعة من القواعد التي يطبقها مالك أو منشئ أو مسؤول موقع أو خدمة لشبكة الكمبيوتر. هذا يقيد الطرق التي يمكن من خلالها استخدام الشبكة أو موقع الويب أو النظام ويضع إرشادات حول كيفية استخدامها. تتم كتابة مستندات AUP للشركات،&nbsp; والجامعات،&nbsp; المدارس، ، مزودي خدمة الإنترنت (ISPs)،&nbsp; وأصحاب مواقع الويب ،&nbsp; في كثير من الأحيان لتقليل إمكانية اتخاذ إجراء قانوني قد يتخذه المستخدم، وغالبًا مع احتمال ضئيل للتنفيذ.</p>
                <p>&nbsp;</p>
                <p>سياسات الاستخدام المقبولة هي جزء لا يتجزأ من إطار عمل سياسات أمن المعلومات غالبًا ما يكون من الممارسات الشائعة أن تطلب من الأعضاء الجدد في أي منظمة التوقيع على سياسة الاستخدام المقبول قبل منحهم حق الوصول إلى أنظمة المعلومات الخاصة بها.</p>
                <p>&nbsp;</p>
                <p>لهذا السبب يجب أن تكون سياسة الاستخدام المقبول موجزة وواضحة. بينما تغطي في نفس الوقت أهم النقاط حول ماهية المستخدمين، والتي لا يُسمح لهم بالقيام بها بأنظمة تكنولوجيا المعلومات الخاصة بالمؤسسة، يجب أن تحيل المستخدمين إلى سياسة الأمان الأكثر شمولاً عند الاقتضاء يجب أيضًا أن تحدد بشكل ملحوظ العقوبات التي سيتم تطبيقها إذا قام المستخدم بخرق سياسة الاستخدام المقبول. يجب قياس الامتثال لهذه السياسة كالمعتاد من خلال عمليات تدقيق منتظمة.</p>
                <p>&nbsp;</p>
                <p>في بعض الحالات يتم تطبيق سياسة الاستخدام العادل على الخدمة التي تسمح بالاستخدام غير المحدود اسميًا مقابل رسوم ثابتة، وهي ببساطة تضع حدًا أقصى لما يمكن استخدامه. الغرض منه هو السماح بالاستخدام العادي ولكن يمنع ما يعتبر مفرطًا. على سبيل المثال قد يتعرض مستخدمو خدمة الإنترنت ذات النطاق العريض &laquo;غير المحدود&raquo; للتعليق أو الإنهاء أو تقييد النطاق الترددي للاستخدام المفرط وغير العادل بشكل مستمر مما يؤثر على تمتع المستخدمين الآخرين بخدمة النطاق العريض.</p>
                <p>&nbsp;</p>
                <p>كما أنه لا يتوافق مع الاستخدام المتوقع عادةً في حزمة وصول معينة ". يتم فرض السياسة مباشرة، دون إجراءات قانونية.</p>
                <p><img style="font-family: NotoKufiArabic; text-align: center; display: block; margin-left: auto; margin-right: auto;" src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></p>
                <h2><strong>المصطلحات:</strong></h2>
                <p>تشبه مستندات AUP وغالبًا ما تؤدي نفس الوظيفة مثل مستند شروط الخدمة (على سبيل المثال، كما هو مستخدم بواسطة جوجل جي ميل وياهو!)، وإن لم يكن دائمًا. في حالة شركة آي بي إم على سبيل المثال: تتعلق شروط الاستخدام بالطريقة التي تقدم بها شركة آي بي إم الموقع، وكيفية تفاعلها مع زوار الموقع وقليل من التعليمات أو عدم وجود تعليمات حول كيفية استخدام الموقع.</p>
                <p>&nbsp;</p>
                <p>في بعض الحالات تسمى مستندات AUP سياسة الإنترنت والبريد الإلكتروني أو سياسة الاستخدام المقبول للإنترنت أو سياسة الاستخدام المقبول للشبكة أو سياسة استخدام تكنولوجيا المعلومات المقبولة.</p>
                <p>&nbsp;</p>
                <p>توفر هذه المستندات، على الرغم من تسميتها بشكل مختلف، إلى حد كبير بيانات السياسة فيما يتعلق بالسلوك المقبول من مستخدمي الشبكة المحلية / الإنترنت المتصلين عبر الشبكة المحلية.</p>
                <p>&nbsp;</p>
                <p>العناصر المشتركة في عبارات AUP</p>
                <p>بشكل عام، غالبًا ما تبدأ بيانات / مستندات AUP ببيان فلسفة المنظمة الراعية والسبب المقصود لسبب تقديم استخدام الإنترنت لمستخدمي شبكة تلك المؤسسة.</p>
                <p>&nbsp;</p>
                <p>على سبيل المثال تتبنى المنظمة الراعية فلسفة التنظيم الذاتي وتوفر اتصال المستخدم بالشبكة المحلية وأيضًا الاتصال بالإنترنت بشرط أن يقبل المستخدم حقيقة أنه سيكون مسؤولاً بشكل شخصي عن الإجراءات المتخذة عند الاتصال بشبكة الإنترنت. الشبكة أو الإنترنت.</p>
                <p>&nbsp;</p>
                <p>قد يعني هذا أن المنظمة لن تقدم أي نظام تحذير في حالة مخالفة المستخدم للسياسة، مع التأكيد على أن الأمر متروك للمستخدم لمعرفة متى تنتهك أفعاله السياسة.</p>
                <p>&nbsp;</p>
                <p>غالبًا ما توفر وثائق سياسة الاستخدام المقبول بيانًا حول استخدام الشبكة و / أو الإنترنت واستخداماتها ومزاياها للأعمال التجارية أو المدرسة أو أي مؤسسة أخرى ترعى الاتصال بالإنترنت.&nbsp; قد يوضح هذا البيان فائدة أنظمة البريد الإلكتروني والقدرة على الحصول على معلومات من مواقع الويب، والاتصال بأشخاص آخرين من خلال استخدام الرسائل الفورية، ومزايا أخرى مماثلة لبروتوكولات مختلفة بما في ذلك خدمات نقل الصوت باستعمال بروتوكول الإنترنت الجديدة نسبيًا.</p>
                <p>&nbsp;</p>
                <p>الجزء الأكثر أهمية من مستند AUP هو مدونة السلوك التي تحكم سلوك المستخدم أثناء الاتصال بالشبكة / الإنترنت. قد تتضمن مدونة قواعد السلوك بعض الوصف لما يمكن تسميته بـ netiquette والذي يتضمن عناصر السلوك مثل استخدام لغة مناسبة / مهذبة أثناء الاتصال بالإنترنت، وتجنب الأنشطة غير القانونية، والتأكد من أن الأنشطة التي قد يشرع فيها المستخدم يجب ألا تزعج أو تعطل أي مستخدم آخر على النظام، والحذر من الكشف عن معلومات شخصية يمكن أن تكون سببًا في سرقة الهوية.</p>
                <p>&nbsp;</p>
                <p>تحدد معظم بيانات سياسة الاستخدام المقبول عواقب انتهاك السياسة. تتم مواجهة هذه الانتهاكات بعواقب اعتمادًا على علاقة المستخدم بالمنظمة.</p>
                <p>&nbsp;</p>
                <p>الإجراءات الشائعة التي تتخذها المدارس والجامعات هي سحب الخدمة إلى المخالف، وفي بعض الأحيان إذا كانت الأنشطة غير قانونية، فقد تُشرك المنظمة السلطات المختصة، مثل الشرطة المحلية.</p>
                <p>&nbsp;</p>
                <p>يقوم أرباب العمل أحيانًا بسحب الخدمة من الموظفين، على الرغم من أن الإجراء الأكثر شيوعًا هو إنهاء العمل عندما تكون الانتهاكات قد تضر بصاحب العمل بطريقة ما، أو قد تعرض الأمن للخطر. إيرثلنك، مزود خدمة الإنترنت الأمريكي لديه سياسة واضحة للغاية فيما يتعلق بانتهاكات سياستها.</p>
                <p><img style="font-family: NotoKufiArabic; text-align: center; display: block; margin-left: auto; margin-right: auto;" src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></p>
                <p>&nbsp;</p>
                <p>&nbsp;تحدد الشركة ستة مستويات للرد على الانتهاكات:</p>
                <p>&nbsp;</p>
                <p>إصدار تحذيرات: كتابية أو شفهية</p>
                <p>تعليق امتيازات نشر مجموعة الأخبار الخاصة بالعضو</p>
                <p>تعليق حساب العضو</p>
                <p>إنهاء حساب العضو</p>
                <p>فاتورة العضو بالتكاليف الإدارية و / أو رسوم إعادة التنشيط</p>
                <p>رفع دعوى قضائية لمنع الانتهاكات و / أو تحصيل تعويضات، إن وجدت، بسبب الانتهاكات.</p>
                <p>يعتبر الجزء المركزي لمعظم مستندات AUP هو القسم الذي يوضح بالتفصيل الاستخدامات غير المقبولة للشبكة، كما هو معروض في جامعة شيكاغو AUP. قد تشمل السلوكيات غير المقبولة إنشاء ونقل مستند أو صور مسيئة أو فاحشة أو غير لائقة، وإنشاء ونقل مواد مصممة للتسبب في الإزعاج أو الإزعاج أو القلق، وإنشاء مواد تشهيرية، وإنشاء ونقل ينتهك حقوق الطبع والنشر لشخص آخر، ونقل من الإعلانات التجارية أو الإعلانية غير المرغوب فيهاالوصول المادي والمتعمد غير المصرح به إلى الخدمات الأخرى التي يمكن الوصول إليها باستخدام الاتصال بالشبكة / الإنترنت. ثم هناك نوع النشاط الذي يستخدم الشبكة لإضاعة وقت الموظفين الفنيين لاستكشاف مشكلة يكون المستخدم سببًا لها، أو إفساد أو تدمير بيانات مستخدم آخر، أو انتهاك خصوصية الآخرين عبر الإنترنت، أو استخدام الشبكة بهذه الطريقة أنه يرفض الخدمة للآخرين، ويستمر في استخدام برنامج أو نظام آخر تم بالفعل تحذير المستخدم بشأن استخدامه، وأي إساءة استخدام أخرى للشبكة مثل إدخال فيروسات.</p>
                <p>&nbsp;</p>
                <p>غالبًا ما يتم إضافة إخلاء المسؤولية من أجل إعفاء منظمة من المسؤولية في ظل ظروف محددة. على سبيل المثال، في حالة جامعة Anglia Ruskin تتم إضافة إخلاء مسؤولية لإعفاء الجامعة من الأخطاء أو السهو أو أي عواقب ناجمة عن استخدام المعلومات الواردة على موقع الجامعة. في حين أنه يمكن إضافة إخلاء المسؤولية إلى أي سياسة الاستخدام المقبول، إلا أنه غالبًا ما يتم العثور على إخلاء المسؤولية في مستندات سياسة الاستخدام المقبول المتعلقة باستخدام موقع ويب بينما يفشل أولئك الذين يقدمون خدمة في إضافة مثل هذه البنود.</p>
                <p>&nbsp;</p>
                <p>على وجه الخصوص، عندما تتم كتابة سياسة الاستخدام العادل من أجل إعداد كلية أو مدرسة، فإن سياسة الاستخدام العادل (AUP) تذكر الطلاب (أو في حالة وجود شركة أو موظفين) بأن الاتصال بالإنترنت، أو استخدام موقع ويب، يعد امتيازًا، كما هو موضح في جامعة Loughborough University تعد سياسة الاستخدام العادل خدمة وليس حق.</p>
                <p>&nbsp;</p>
                <p>من خلال التأكيد على جانب &laquo;الامتياز&raquo; هذا، تقوم جامعة نورثرن إلينوي بالربط بين أن أي إساءة لهذا الامتياز يمكن أن تؤدي إلى اتخاذ إجراء قانوني من الجامعة.</p>
                <p><img style="font-family: NotoKufiArabic; text-align: center; display: block; margin-left: auto; margin-right: auto;" src="../filemanager/uploads/E&amp;S-01.png" alt="E&amp;S-01.png" width="130" height="130" /></p>
                <p>&nbsp;</p>
                <p>في كتيب لكتابة مستندات AUP ، تشير وزارة التعليم في فرجينيا إلى أن هناك ثلاثة مجالات أخرى تحتاج إلى المعالجة في سياسة الاستخدام العادل:</p>
                <p>&nbsp;</p>
                <p>بيان يفيد بأن سياسة الاستخدام المقبول (AUP)</p>
                <p>&nbsp;تمتثل لقواعد ولوائح الاتصالات الحكومية والوطنية</p>
                <p>بيان بشأن الحاجة إلى الحفاظ على السلامة الشخصية والخصوصية أثناء الوصول إلى الإنترنت</p>
                <p>بيان بشأن الحاجة إلى الامتثال لقوانين الاستخدام العادل وأنظمة حقوق النشر الأخرى أثناء الوصول إلى الإنترنت</p>
                <p>من خلال القراءة السريعة لبيانات AUP التي وجدها بحث جوجل، يكون التباين في تضمين هذه العناصر في مستندات AUP متغيرًا بدرجة كبيرة. ومع ذلك، من المرجح أن تتضمن تلك البيانات في بيئة المدرسة أو الجامعة بيانًا لمعالجة مشكلة &laquo;السلامة الشخصية&raquo; على الأقل.</p>']
            ],'key'
        );
    }
}
